//Строгий режим
"use strict";
//Переменная – это «именованное хранилище» для данных. Мы можем использовать
// переменные для хранения товаров, посетителей и других данных.

//Для создания переменной в JavaScript используйте ключевое слово let и const

//В JavaScript есть два ограничения, касающиеся имён переменных:
// Имя переменной должно содержать только буквы, цифры или символы $ и _.
// Первый символ не должен быть цифрой.

//Обьвление переменной зерез let
let number = 5;

//Обьявление переменной через const
const leftBorderWidth = 1;

//Вывод в консоль
console.log(number);

//Старый вариант обьявления переменной var
//var - создается до обьвления переменной (Всплытие переменной)
console.log(name);
var name = 'Max';

//let и const являются локальными переменными

//Конструкция где обьзательно нуужно ставить ;
alert(5);
[].push('a');
